logs/artillery.txt
Phase started: unnamed (index: 0, duration: 1s) 17:27:54(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 17:27:55(-0300)

--------------------------------------
Metrics for period to: 17:28:00(-0300) (width: 3.994s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 253/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 16
  max: ......................................................................... 366
  median: ...................................................................... 165.7
  p95: ......................................................................... 214.9
  p99: ......................................................................... 262.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2462.7
  max: ......................................................................... 3336
  median: ...................................................................... 3197.8
  p95: ......................................................................... 3328.3
  p99: ......................................................................... 3328.3


All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 17:28:00(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 253/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 16
  max: ......................................................................... 366
  median: ...................................................................... 165.7
  p95: ......................................................................... 214.9
  p99: ......................................................................... 262.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2462.7
  max: ......................................................................... 3336
  median: ...................................................................... 3197.8
  p95: ......................................................................... 3328.3
  p99: ......................................................................... 3328.3